Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/tc.h
/* -------- TC_PTCR : (TC Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define TC_PTCR_RXTEN_Pos                     _UINT32_(0)                                          /* (TC_PTCR) Receiver Transfer Enable Position */
#define TC_PTCR_RXTEN_Msk                     (_UINT32_(0x1) << TC_PTCR_RXTEN_Pos)                 /* (TC_PTCR) Receiver Transfer Enable Mask */
#define TC_PTCR_RXTEN(value)                  (TC_PTCR_RXTEN_Msk & (_UINT32_(value) << TC_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the TC_PTCR register */
#define TC_PTCR_RXTDIS_Pos                    _UINT32_(1)                                          /* (TC_PTCR) Receiver Transfer Disable Position */
#define TC_PTCR_RXTDIS_Msk                    (_UINT32_(0x1) << TC_PTCR_RXTDIS_Pos)                /* (TC_PTCR) Receiver Transfer Disable Mask */
#define TC_PTCR_RXTDIS(value)                 (TC_PTCR_RXTDIS_Msk & (_UINT32_(value) << TC_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the TC_PTCR register */
#define TC_PTCR_TXTEN_Pos                     _UINT32_(8)                                          /* (TC_PTCR) Transmitter Transfer Enable Position */
#define TC_PTCR_TXTEN_Msk                     (_UINT32_(0x1) << TC_PTCR_TXTEN_Pos)                 /* (TC_PTCR) Transmitter Transfer Enable Mask */
#define TC_PTCR_TXTEN(value)                  (TC_PTCR_TXTEN_Msk & (_UINT32_(value) << TC_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the TC_PTCR register */
#define TC_PTCR_TXTDIS_Pos                    _UINT32_(9)                                          /* (TC_PTCR) Transmitter Transfer Disable Position */
#define TC_PTCR_TXTDIS_Msk                    (_UINT32_(0x1) << TC_PTCR_TXTDIS_Pos)                /* (TC_PTCR) Transmitter Transfer Disable Mask */
#define TC_PTCR_TXTDIS(value)                 (TC_PTCR_TXTDIS_Msk & (_UINT32_(value) << TC_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the TC_PTCR register */
#define TC_PTCR_RXCBEN_Pos                    _UINT32_(16)                                         /* (TC_PTCR) Receiver Circular Buffer Enable Position */
#define TC_PTCR_RXCBEN_Msk                    (_UINT32_(0x1) << TC_PTCR_RXCBEN_Pos)                /* (TC_PTCR) Receiver Circular Buffer Enable Mask */
#define TC_PTCR_RXCBEN(value)                 (TC_PTCR_RXCBEN_Msk & (_UINT32_(value) << TC_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the TC_PTCR register */
#define TC_PTCR_RXCBDIS_Pos                   _UINT32_(17)                                         /* (TC_PTCR) Receiver Circular Buffer Disable Position */
#define TC_PTCR_RXCBDIS_Msk                   (_UINT32_(0x1) << TC_PTCR_RXCBDIS_Pos)               /* (TC_PTCR) Receiver Circular Buffer Disable Mask */
#define TC_PTCR_RXCBDIS(value)                (TC_PTCR_RXCBDIS_Msk & (_UINT32_(value) << TC_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the TC_PTCR register */
#define TC_PTCR_TXCBEN_Pos                    _UINT32_(18)                                         /* (TC_PTCR) Transmitter Circular Buffer Enable Position */
#define TC_PTCR_TXCBEN_Msk                    (_UINT32_(0x1) << TC_PTCR_TXCBEN_Pos)                /* (TC_PTCR) Transmitter Circular Buffer Enable Mask */
#define TC_PTCR_TXCBEN(value)                 (TC_PTCR_TXCBEN_Msk & (_UINT32_(value) << TC_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the TC_PTCR register */
#define TC_PTCR_TXCBDIS_Pos                   _UINT32_(19)                                         /* (TC_PTCR) Transmitter Circular Buffer Disable Position */
#define TC_PTCR_TXCBDIS_Msk                   (_UINT32_(0x1) << TC_PTCR_TXCBDIS_Pos)               /* (TC_PTCR) Transmitter Circular Buffer Disable Mask */
#define TC_PTCR_TXCBDIS(value)                (TC_PTCR_TXCBDIS_Msk & (_UINT32_(value) << TC_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the TC_PTCR register */
#define TC_PTCR_ERRCLR_Pos                    _UINT32_(24)                                         /* (TC_PTCR) Transfer Bus Error Clear Position */
#define TC_PTCR_ERRCLR_Msk                    (_UINT32_(0x1) << TC_PTCR_ERRCLR_Pos)                /* (TC_PTCR) Transfer Bus Error Clear Mask */
#define TC_PTCR_ERRCLR(value)                 (TC_PTCR_ERRCLR_Msk & (_UINT32_(value) << TC_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the TC_PTCR register */
#define TC_PTCR_Msk                           _UINT32_(0x010F0303)                                 /* (TC_PTCR) Register Mask  */


/* -------- TC_PTSR : (TC Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define TC_PTSR_RXTEN_Pos                     _UINT32_(0)                                          /* (TC_PTSR) Receiver Transfer Enable Position */
#define TC_PTSR_RXTEN_Msk                     (_UINT32_(0x1) << TC_PTSR_RXTEN_Pos)                 /* (TC_PTSR) Receiver Transfer Enable Mask */
#define TC_PTSR_RXTEN(value)                  (TC_PTSR_RXTEN_Msk & (_UINT32_(value) << TC_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the TC_PTSR register */
#define TC_PTSR_TXTEN_Pos                     _UINT32_(8)                                          /* (TC_PTSR) Transmitter Transfer Enable Position */
#define TC_PTSR_TXTEN_Msk                     (_UINT32_(0x1) << TC_PTSR_TXTEN_Pos)                 /* (TC_PTSR) Transmitter Transfer Enable Mask */
#define TC_PTSR_TXTEN(value)                  (TC_PTSR_TXTEN_Msk & (_UINT32_(value) << TC_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the TC_PTSR register */
#define TC_PTSR_RXCBEN_Pos                    _UINT32_(16)                                         /* (TC_PTSR) Receiver Circular Buffer Enable Position */
#define TC_PTSR_RXCBEN_Msk                    (_UINT32_(0x1) << TC_PTSR_RXCBEN_Pos)                /* (TC_PTSR) Receiver Circular Buffer Enable Mask */
#define TC_PTSR_RXCBEN(value)                 (TC_PTSR_RXCBEN_Msk & (_UINT32_(value) << TC_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the TC_PTSR register */
#define TC_PTSR_TXCBEN_Pos                    _UINT32_(18)                                         /* (TC_PTSR) Transmitter Circular Buffer Enable Position */
#define TC_PTSR_TXCBEN_Msk                    (_UINT32_(0x1) << TC_PTSR_TXCBEN_Pos)                /* (TC_PTSR) Transmitter Circular Buffer Enable Mask */
#define TC_PTSR_TXCBEN(value)                 (TC_PTSR_TXCBEN_Msk & (_UINT32_(value) << TC_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the TC_PTSR register */
#define TC_PTSR_ERR_Pos                       _UINT32_(24)                                         /* (TC_PTSR) Transfer Bus Error Position */
#define TC_PTSR_ERR_Msk                       (_UINT32_(0x1) << TC_PTSR_ERR_Pos)                   /* (TC_PTSR) Transfer Bus Error Mask */
#define TC_PTSR_ERR(value)                    (TC_PTSR_ERR_Msk & (_UINT32_(value) << TC_PTSR_ERR_Pos)) /* Assigment of value for ERR in the TC_PTSR register */
#define TC_PTSR_Msk                           _UINT32_(0x01050101)                                 /* (TC_PTSR) Register Mask  */


/* -------- TC_PWPMR : (TC Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define TC_PWPMR_WPPTREN_Pos                  _UINT32_(0)                                          /* (TC_PWPMR) Write Protection Pointer Registers Enable Position */
#define TC_PWPMR_WPPTREN_Msk                  (_UINT32_(0x1) << TC_PWPMR_WPPTREN_Pos)              /* (TC_PWPMR) Write Protection Pointer Registers Enable Mask */
#define TC_PWPMR_WPPTREN(value)               (TC_PWPMR_WPPTREN_Msk & (_UINT32_(value) << TC_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the TC_PWPMR register */
#define TC_PWPMR_WPCTREN_Pos                  _UINT32_(1)                                          /* (TC_PWPMR) Write Protection Counter Registers Enable Position */
#define TC_PWPMR_WPCTREN_Msk                  (_UINT32_(0x1) << TC_PWPMR_WPCTREN_Pos)              /* (TC_PWPMR) Write Protection Counter Registers Enable Mask */
#define TC_PWPMR_WPCTREN(value)               (TC_PWPMR_WPCTREN_Msk & (_UINT32_(value) << TC_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the TC_PWPMR register */
#define TC_PWPMR_WPCREN_Pos                   _UINT32_(2)                                          /* (TC_PWPMR) Write Protection Control Register Enable Position */
#define TC_PWPMR_WPCREN_Msk                   (_UINT32_(0x1) << TC_PWPMR_WPCREN_Pos)               /* (TC_PWPMR) Write Protection Control Register Enable Mask */
#define TC_PWPMR_WPCREN(value)                (TC_PWPMR_WPCREN_Msk & (_UINT32_(value) << TC_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the TC_PWPMR register */
#define TC_PWPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (TC_PWPMR) Write Protection Key Position */
#define TC_PWPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << TC_PWPMR_WPKEY_Pos)           /* (TC_PWPMR) Write Protection Key Mask */
#define TC_PWPMR_WPKEY(value)                 (TC_PWPMR_WPKEY_Msk & (_UINT32_(value) << TC_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the TC_PWPMR register */
#define   TC_PWPMR_WPKEY_PASSWD_Val           _UINT32_(0x504443)                                   /* (TC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define TC_PWPMR_WPKEY_PASSWD                 (TC_PWPMR_WPKEY_PASSWD_Val << TC_PWPMR_WPKEY_Pos)    /* (TC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define TC_PWPMR_Msk                          _UINT32_(0xFFFFFF07)                                 /* (TC_PWPMR) Register Mask  */


